/*
Localizable.strings
PanicGit

Created by Logan Collins on 2/24/18.
Copyright © 2018 Panic Inc. All rights reserved.
*/


// Operations

// "Downloading Objects: 12 of 100 (100KB)"
"Downloading Objects: %@ of %@ (%@)" = "Objekte herunterladen: %@ von %@ (%@)";

// "Indexing Deltas: 12 of 100"
"Indexing Deltas: %@ of %@" = "Deltas indizieren: %@ von %@";

// "Packing Objects: 12 of 100"
"Packing Objects: %@ of %@" = "Objekte verpacken: %@ von %@";

// "Uploading Objects: 12 of 100 (100KB)"
"Uploading Objects: %@ of %@ (%@)" = "Objekte hochladen: %@ von %@ (%@)";

// "Checking Out Files: 12 of 100"
"Checking Out Files: %@ of %@" = "Dateien auschecken: %@ von %@";


// SSH host key authentication
"The %@ %@ fingerprint is:\n%@" = "Der %@-%@-Fingerabdruck ist:\n%@";


// Errors
"Error returned from libgit2: %@ (%ld)" = "Zurückgegebener Fehler von libgit2: %@ (%ld)";
"Error code from libgit2: (%ld)" = "Zurückgegebener Fehler von libgit2: (%ld)";

"The requested object was not found." = "Das angeforderte Objekte wurde nicht gefunden.";
"The requested object already exists." = "Das angeforderte Objekt ist bereits vorhanden.";
"Multiple ambiguous matching objects were found." = "Es wurden mehrere mehrdeutige übereinstimmende Objekte gefunden.";
"The provided buffer was too short." = "Der bereitgestellte Puffer war zu kurz.";
"This operation cannot be performed on a bare repository." = "Dieser Vorgang kann nicht mit einem Bare-Repository ausgeführt werden.";
"The branch contains no commits." = "Der Zweig enthält keine Commits.";
"Unmerged changes must be resolved before the operation can be performed." = "Nicht zusammengeführte Änderungen müssen gelöst werden, bevor der Vorgang durchgeführt werden kann.";
"The reference cannot be fast-forwarded and must instead be merged or rebased." = "Mit der Referenz kann kein Fast Forward durchgeführt werden, stattdessen muss ein Merge oder Rebase stattfinden.";
"The provided reference name or refspec was invalid." = "Der angegebene Referenzname oder die refspec war ungültig.";
"One or more conflicts prevented the operation from being performed.\n\nCommit or stash any uncommitted changes and try again." = "Mindestens ein Konflikt verhinderte die Ausführung des Vorgangs.\n\nFühren Sie einen Commit oder Stash für nicht committete Änderungen aus und versuchen Sie es erneut.";
"There are locked files which prevented the operation from being performed." = "Es gibt gesperrte Dateien, die die Durchführung des Vorgangs verhindert haben.";
"The reference has been modified by another operation." = "Die Referenz wurde von einem anderen Vorgang geändert.";
"Credentials were not accepted by the server. Make sure your password or SSH key is set up correctly.\n\nIf you are using an SSH config file, make sure it is not unexpectedly overriding options for the host." = "Accountdaten wurden vom Server nicht akzeptiert. Stellen Sie sicher, dass Ihr Passwort oder SSH-Schlüssel richtig eingerichtet ist.\n\nWenn Sie eine SSH-Konfigurationsdatei verwenden, vergewissern Sie sich, dass sie nicht unerwartet Optionen für den Host überschreibt.";
"The certificate for the server is invalid. Make sure you have a valid secure connection to the server and that there is not a proxy server that may be downgrading security." = "Das Zertifikat für den Server ist ungültig. Stellen Sie sicher, dass Sie über eine gültige sichere Verbindung zum Server verfügen und dass kein Proxyserver vorhanden ist, der möglicherweise die Sicherheit herabsetzt.";
"The provided patch or merge has already been applied." = "Der bereitgestellte Patch oder Merge wurde bereits angewendet.";
"The requested peel operation is not possible." = "Der angeforderte Peel-Vorgang ist nicht möglich.";
"An unexpected end of file was encountered." = "Es wurde ein unerwartetes Dateiende festgestellt.";
"The requested operation or input is invalid." = "Der angeforderte Vorgang oder die angeforderte Eingabe ist ungültig.";
"There are uncommitted changes which must be committed or stashed before the operation can be performed." = "Es gibt Änderungen ohne Commit, für die ein Commit durchgeführt oder ein Stash erstellt werden muss, bevor der Vorgang durchgeführt werden kann.";
"This operation is not valid for the specified directory." = "Dieser Vorgang ist für das angegebene Verzeichnis nicht gültig.";
"There are merge conflicts which must be resolved before the operation can be performed." = "Es gibt Merge-Konflikte, die gelöst werden müssen, bevor der Vorgang durchgeführt werden kann.";
"The hash sum of one or more objects does not match." = "Die Hash-Summe eines oder mehrerer Objekte stimmt nicht überein.";
"Unsaved changes in the index would be overridden by the operation." = "Nicht gesicherte Änderungen im Index würden durch den Vorgang überschrieben.";
"Failed to apply the patch." = "Anwenden des Patches fehlgeschlagen.";
"The object is not owned by the current user." = "Das Objekt ist nicht im Besitz des aktuellen Benutzers.";
"The operation was cancelled." = "Der Vorgang wurde abgebrochen.";


// Tasks
"Failed to invoke Git “%@” hook." = "Aufrufen von Git „%@“-Hook fehlgeschlagen.";
"Failed to invoke Git credential helper." = "Aufrufen von Git-Accountdaten-Hilfsprogramm fehlgeschlagen.";

"Task “%@” terminated with an uncaught signal." = "Die Aufgabe „%@“ wurde mit einem nicht abgefangenen Signal beendet.";
"Task “%@” terminated with a non-zero exit code: %d." = "Die Aufgabe „%@“ wurde mit einem Beendigungscode ungleich Null beendet: %d.";


// Signing
"Invalid Git signing format specified." = "Ungültiges Git-Signierformat festgelegt.";
"The “gpg.format” configuration value is set to “%@”, which is not supported." = "Der Konfigurationswert „gpg.format“ wird auf „%@“ gesetzt, was nicht unterstützt wird.";
"Could not sign payload using %@." = "Payload konnte mit %@ nicht signiert werden.";
"A valid signing key was not provided using either `user.signingkey` or `gpg.ssh.defaultKeyCommand`." = "Ein gültiger Signaturschlüssel wurde weder mit `user.signingkey` noch mit `gpg.ssh.defaultKeyCommand` bereitgestellt.";
"Task “%@” did not generate a signature in its output." = "Die Aufgabe „%@“ hat in ihrer Ausgabe keine Signatur generiert.";


// Apply Stash
"Applying stash…" = "Stash anwenden …";
"Failed to apply stash." = "Anwenden des Stash fehlgeschlagen.";

// Checkout
"Checking out “%@”…" = "„%@“ auschecken …";
"Checking out HEAD…" = "HEAD auschecken …";

"Failed to checkout tree." = "Auschecken des Baums fehlgeschlagen.";

// Cherry-pick
"Cherry-picking “%@”…" = "Cherry-Pick-Vorgang für „%@“ …";

"Failed to cherry-pick commits." = "Cherry-Pick-Vorgang für Commits fehlgeschlagen.";

// Clone
"Cloning into “%@”…" = "Klonen in „%@“ …";

"Failed to clone repository." = "Klonen des Repositorys fehlgeschlagen.";

// Commit
"Committing “%@”…" = "Commit für „%@“ wird ausgeführt …";

"Failed to commit tree." = "Commit des Baums fehlgeschlagen.";

// Fetch
"Fetching from “%@”…" = "Von „%@“ abrufen …";
"Fetching “%@” from “%@”…" = "„%@“ von „%@“ abrufen …";
"Fetching %@ refs from “%@”…" = "%@ Referenzen von „%@“ abrufen …";

"Failed to fetch from “%@”." = "Abrufen von „%@“ fehlgeschlagen.";

// List References
"Listing remote references for “%@”…" = "Remotebezüge für „%@“ auflisten …"; // Where a "reference" is a Git remote reference (such as a branch or tag)

"Failed to fetch remote references from “%@”." = "Das Abrufen der Remotebezüge von „%@“ ist fehlgeschlagen."; // Where a "reference" is a Git remote reference (such as a branch or tag)

// Merge
"Merging “%@”…" = "„%@“ zusammenführen …";
"Merging %@ references…" = "%@ Referenzen werden zusammengeführt …";

"Failed to merge references." = "Zusammenführen der Referenzen fehlgeschlagen.";

// Prune
"Pruning references for “%@”…" = "Referenzen für „%@“ werden gelöscht …";

"Failed to prune remote references from “%@”." = "Löschen der entfernten Referenzen von „%@“ fehlgeschlagen.";

// Push
"Pushing to “%@”…" = "Push nach „%@“ durchführen …";
"Pushing “%@” to “%@”…" = "Push von „%@“ nach „%@“ durchführen …";
"Pushing %@ refs to “%@”…" = "Push von %@ Referenzen nach „%@“ durchführen …";

"Failed to push to “%@”." = "Push nach „%@“ fehlgeschlagen.";

"Failed to push some references." = "Pushen einiger Referenzen fehlgeschlagen.";
"One or more references were rejected by the server." = "Mindestens eine Referenz wurde vom Server abgelehnt.";

// Update submodule
"Updating submodule “%@”…" = "Submodul „%@“ aktualisieren …";

"Failed to update submodule “%@”." = "Update des Submoduls fehlgeschlagen.";
